import Title from "@/ui/Title";
import { Metadata } from "next";
import Image from "next/image";
import React from "react";

export const metadata: Metadata = {
	title: "About us",
	description: "About us",
};

const About = () => {
	return (
		<main className="container">
			<Title titleText="About ASS" />
			<section>
				<Image
					className="mb-8 max-h-[34.75rem] w-full object-cover"
					src="/images/mag4-2.webp"
					width={1216}
					height={556}
					alt="About us"
				/>
				<h2 className="mb-3 text-2xl font-semibold">About Us</h2>
				<div className="mb-8 flex flex-col gap-3 indent-5">
					<p className="">
						Максим і Сергій - це тандем талановитих
						фронтенд-розробників, які не лише знають мову
						програмування JavaScript на відмінно, але і вміють
						створювати захоплюючі веб-інтерфейси, які вражають своєю
						красою та функціональністю. Вони - справжні майстри
						React та Redux, завдяки чому їхні проекти завжди мають
						чудову структуру та ефективне керування станом додатку.
						Аналогія з аніме не залишається осторонь: як і головні
						герої у своїх улюблених аніме-серіалах, Максим і Сергій
						відзначаються неймовірною винахідливістю та відданістю
						своїй справі. Їхня командна робота схожа на синхронний
						танець, де кожен крок має точний ритм, так само як і
						кожен елемент їхніх веб-додатків має своє місце та
						функціональність. Код Максима і Сергія - це справжній
						шедевр, подібно як улюблені аніме стають шедеврами
						жанру. Вони вміють майстерно працювати з MongoDB,
						забезпечуючи ефективне зберігання та обробку даних, а
						їхній використання TypeScript допомагає уникнути помилок
						на етапі розробки, як магічні закляття в улюблених
						аніме.
					</p>
					<p>
						Серце Максима та Сергія б'ється в такт з бібліотекою
						Tailwind CSS, яка дозволяє їм створювати візуально
						захоплюючі та адаптивні інтерфейси, схожі на незабутні
						світи їхніх улюблених аніме-всесвітів. А їхня
						впевненість у використанні HTML та CSS відбивається в
						кожному пікселі їхніх творінь, так само як герої аніме
						проявляють впевненість у власних здібностях. Ще одна
						спільна риса Максима, Сергія та їхніх улюблених
						аніме-персонажів - це відчуття справедливості. Вони
						об'єднуються в боротьбі проти ненависної РУСНІ, як
						справжні герої аніме-сюжетів борються зі злом. Їхні
						веб-додатки - це як мечі справедливості, що захищають
						користувачів від негативних впливів.
					</p>
					<p>
						Закінчуючи, Максим і Сергій - це динамічний дует, який
						поєднує в собі технічну майстерність і хвилюючий дух
						пригод, схожий на найкращі аніме-драми. Вони створюють
						веб-інтерфейси, які залишають незабутні враження, так
						само як і їхні улюблені аніме залишають слід у серцях
						глядачів.
					</p>
				</div>
				<div className="mb-8">
					<h2 className="mb-3 text-2xl font-semibold">Skills:</h2>
					<ul className="flex list-disc flex-col gap-3 pl-7 text-primary dark:text-secondary">
						<li className="">
							<strong>React Jutsu:</strong> Максим та Сергій
							володіють майстерністю у розробці фронтенд-додатків
							на React. Їхня реактивна магія подібна до вражаючого
							стилю боїв в аніме "Naruto", де герої миттєво
							реагують на зміни, як і вони - на кожний клік
							користувача.
						</li>
						<li className="">
							<strong>Redux Alchemy:</strong> Як алхіміки з аніме
							"Fullmetal Alchemist", Максим і Сергій майстерно
							змішують стани та дії в Redux, створюючи гармонійну
							систему управління даними, як і алхімічні реакції
							перетворюють одну речовину на іншу.
						</li>
						<li className="">
							<strong>MongoDB Time Travel:</strong> Навички роботи
							з MongoDB дозволяють їм створювати додатки, які
							здаються магічною порталом у часі, подібно до
							унікальних здібностей персонажів з аніме
							"Steins;Gate".
						</li>
						<li className="">
							<strong>Tailwind Ninjutsu:</strong> Використання
							бібліотеки Tailwind CSS - це справжній ніндзя-арт у
							створенні стильних та адаптивних інтерфейсів. Їхній
							Tailwind Ninjutsu нагадує майстерність воїнів з
							аніме "Naruto", які швидко та точно атакують своїх
							ворогів.
						</li>
						<li className="">
							<strong>CSS Magic Spells:</strong> Максим і Сергій
							володіють магічними заклинаннями CSS, які
							перетворюють прості стилі в візуальне чудо. Їхня
							майстерність нагадує навички володіння елементами
							води в аніме "Avatar: The Last Airbender".
						</li>
						<li className="">
							<strong>SCSS Alchemy:</strong> Використання
							препроцесору SCSS дозволяє їм створювати стилі, які
							змінюються під час компіляції, схожо на трансмутації
							алхіміків з аніме "Fullmetal Alchemist", які здатні
							змінювати форму речовин.
						</li>
						<li className="">
							<strong>HTML Elemental Arts:</strong> Максим і
							Сергій володіють відомостями HTML, як володінням
							елементарними силами в аніме "My Hero Academia".
							Вони використовують HTML, щоб створювати основи
							своїх інтерфейсів, як герої використовують свої
							здібності для захисту світу.
						</li>
					</ul>
				</div>
				<div className="mb-8">
					<h2 className="mb-3 text-2xl font-semibold">Experience:</h2>
					<ul className="flex list-disc flex-col gap-3 pl-7">
						<li className="">
							Епічні Додатки на React: Ми - Максим та Сергій,
							маємо значний досвід у створенні захоплюючих
							веб-додатків на основі React. Наші проекти вражають
							якістю коду та взаємодії, немов улюблені персонажі з
							епічних аніме боряться у вирішальних сценах.
						</li>
						<li className="">
							Переход на Наступний Рівень з Next.js: Ми також
							активно використовуємо фреймворк Next.js, додавши до
							нашого арсеналу нові можливості. Наш досвід з
							Next.js допомагає нам розробляти веб-додатки з
							високою продуктивністю та швидкістю, як персонажі,
							які вдосконалюють свої навички під час тренувань.
						</li>
						<li className="">
							Типізований Підхід за Допомогою TypeScript: Ми
							віддаємо перевагу чіткому та структурованому коду,
							тому TypeScript - наш вибір для забезпечення
							типізації та зменшення можливих помилок. Наш досвід
							у використанні TypeScript нагадує вдосконалення
							навичок персонажів аніме, які набирають силу та
							контроль під час найважчих битв.
						</li>
						<li className="">
							Майстерство Верстки, Що Вражає: Наш великий досвід у
							верстці робить наші додатки не лише функціональними,
							а й неймовірно привабливими. Ми створюємо
							інтерфейси, які переносять елементи з аніме-стилю у
							веб-середовище, захоплюючи користувачів так само, як
							улюблені сцени зі світу аніме.
						</li>
					</ul>
				</div>
				<div className="mb-8">
					<h2 className="mb-3 text-2xl font-semibold">Education:</h2>
					<ul className="flex list-disc flex-col gap-3 pl-7">
						<li className="">
							Академія "TechMage": Ця престижна школа
							програмування та технологій допомогла вам освоїти
							всі аспекти розробки веб-додатків. Навчання в
							академії нагадує тренування героїв з аніме "My Hero
							Academia", де студенти розвивають свої навички та
							здібності, щоб стати справжніми технологічними
							магами.
						</li>
						<li className="">
							Школа "CodeSorcery": Школа "CodeSorcery" виробляє
							справжніх чарівників програмування. Тут ви не тільки
							навчилися розробляти веб-додатки, але й освоїли
							мистецтво верстки, додавання анімацій та створення
							неймовірно стильних інтерфейсів. Відштовхуючись від
							магійних світів аніме "Fairy Tail", ви стали
							справжніми володарями коду та дизайну.
						</li>
					</ul>
				</div>
			</section>
		</main>
	);
};

export default About;
